REGISTRATION_STATUS = {
    "372323199509260348": {
        "状态": "已注册",
        "注册时间": "2021-03-01",
        "注册地点": "济南市",
        "管理员": "王芳芳",
        "角色": "专技个人",
        "单位": "山东省济南市中心医院",
    },
}

ADMINISTRATOR_CONTACT = {
    "372323199509260348": {
        "管理员": "王芳芳",
        "联系方式": "18000000000",
    },
}

CREDIT_HOURS = {
    "372323199509260348": {
        "2019": {
            "公需课": [
                {"课程名称": "公需课1", "学时": 10, "进度": 100, "考核": "合格"},
                {"课程名称": "公需课2", "学时": 10, "进度": 100, "考核": "合格"},
                {"课程名称": "公需课3", "学时": 10, "进度": 100, "考核": "未完成"},
                {"课程名称": "公需课4", "学时": 10, "进度": 85, "考核": "未完成"},
            ],
            "专业课": [
                {"课程名称": "专业课1", "学时": 10, "进度": 100, "考核": "合格"},
                {"课程名称": "专业课2", "学时": 10, "进度": 100, "考核": "合格"},
                {"课程名称": "专业课3", "学时": 10, "进度": 100, "考核": "未完成"},
                {"课程名称": "专业课4", "学时": 10, "进度": 85, "考核": "未完成"},
            ],
        },
        "2020": {
            "公需课": [
                {"课程名称": "公需课5", "学时": 10, "进度": 100, "考核": "未完成"},
                {"课程名称": "公需课6", "学时": 10, "进度": 12, "考核": "未完成"},
            ],
            "专业课": [
                {"课程名称": "专业课5", "学时": 10, "进度": 85, "考核": "未完成"},
            ],
        },
    }
}

COURSE_PURCHASES = {
    "372323199509260348": {
        "2023": {
            "新闻专业课培训班": {
                "课程名称": "新闻专业课培训班",
                "课程类别": "专业课",
                "学时": 10,
                "进度": 90,
                "考核": "未完成",
                "购买时间": "2023-01-01",
                "购买地点": "山东省济南市",
                "培训机构": "山东省新闻学院",
            },
        },
        "2024": {
            "新闻专业课培训班": {
                "课程名称": "新闻专业课培训班",
                "课程类别": "专业课",
                "学时": 10,
                "进度": 0,
                "考核": "未完成",
                "购买时间": "2024-01-01",
                "购买地点": "山东省济南市",
                "培训机构": "山东省新闻学院",
            },
        },
    }
}


LOC_STR = """
1、滨州：滨州市专业技术人员继续教育公共服务平台（滨州市继续教育平台、滨州市专业技术人员继续教育公需课/专业课培训平台）\n\n
2、德州：德州市专业技术人员继续教育服务平台（德州市继续教育平台、）\n\n
3、东营：东营市继续教育网（东营市专业技术人员继续教育公共服务平台、东营市继续教育、东营市继续教育网专业科目/公需科目培训平台）\n\n
4、济南：济南市专业技术人员继续教育公共服务平台（济南市继续教育平台、济南市平台）\n\n
5、济宁：济宁市专业技术人员继续教育管理服务平台（济宁市专业技术人员学习平台、济宁市继续教育平台）\n\n
6、烟台：鲁东大学、山东商务职业学院\n\n
7、日照：日照市专业技术人员继续教育公共服务平台（日照市继续教育平台）\n\n
8、泰安：泰安市专业技术人员继续教育平台\n\n
9、威海：威海市专业技术人员继续教育服务平台（威海市继续教育平台）\n\n
10、枣庄：枣庄市专业技术人员继续教育服务平台（枣庄市继续教育平台、）\n\n
11、淄博：淄博市专业技术人员继续教育公共服务云平台（淄博市继续教育平台、淄博市平台）\n\n
12、山东省：山东省专业技术人员继续教育公共服务平台（山东省公共服务平台，山东省平台，山东省继续继续教育平台）\n\n
"""